import React from "react";
import { connect } from "react-redux";
import { setNameOfClickedRegion } from "../../redux/actions/CampingsActions";
import City from "./City";
import "./SelectCity.scss";

function SelectCity(props) {
  let {setNameOfClickedRegion, selectedRegion, desktop, mobile} = props;

	const regions = ["Адыгея", "Алтай", "Башкортостан", "Бурятия", "Дагестан", "Ингушетия", "Кабардино-Балкария",
	"Калмыкия", "Карачаево-Черкессия", "Карелия", "Коми", "Марий Эл", "Мордовия", "Саха (Якутия)", "Северная Осетия - Алания",
	"Татарстан", "Тыва", "Удмуртская", "Хакасия", "Чеченская", "Чувашская Республика", "Алтайский край", "Забайкальский край",
	"Камчатский край", "Краснодарский край", "Красноярский край", "Пермский край", "Приморский край", "Ставропольский край",
	"Хабаровский край", "Амурская область", "Архангельская область", "Астраханская область", "Белгородская область", "Брянская область",
	"Владимирская область", "Волгоградская область", "Вологодская область", "Воронежская область", "Ивановская область",
	"Иркутская область", "Калининградская область", "Калужская область", "Кемеровская область", "Кировская область", 
	"Костромская область", "Курганская область", "Курская область", "Ленинградская область", "Липецкая область", "Магаданская область",
	"Московская область", "Мурманская область", "Нижегородская область", "Новгородская область", "Новосибирская область", 
	"Омская область", "Оренбургская область", "Орловская область", "Пензенская область", "Псковская область", "Ростовская область",
	"Рязанская область", "Самарская область", "Саратовская область", "Сахалинская область", "Свердловская область", "Смоленская область",
	"Тамбовская область", "Тверская область", "Томская область", "Тульская область", "Тюменская область", "Ульяновская область",
	"Челябинская область", "Москва", "Санкт-Петербург", "Еврейская АО", "Ненецкий АО", "Ярославская область", "Ханты-Мансийский АО",
	"Чукотский АО", "Ямало-Ненецкий АО"].sort();
  return (
    <div onClick = {(e) => setNameOfClickedRegion(e)} name="region" className = "region modalWindow" id={desktop ? "selectCity" : (mobile ? "selectCityMobile" : null)}>
			<span className = "region__header">{selectedRegion ? selectedRegion : "Выберите регион"}</span>
			{regions.map((curr) => {
				return <City nameOfRegion = {curr} />
			})}
    </div>
  )
}

const MapDispatchToProps = (dispatch) => {
	return({
		setNameOfClickedRegion: (e) => dispatch(setNameOfClickedRegion(e))
	})
}

export default connect(null, MapDispatchToProps)(SelectCity);